---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCConnectedWallData.Location
source: html/4d6beedd-0637-9f02-61cd-fa71b7656e35.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallData.Location Property

The location for the join.

## Syntax (C#)
```csharp
public IFCConnectedWallDataLocation Location { get; }
```